benchmark testing/load_workloada_mongodb.txt
/usr/bin/java  -classpath /home/alec_fei/ycsb-0.17.0/conf:/home/alec_fei/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/home/alec_fei/ycsb-0.17.0/lib/core-0.17.0.jar:/home/alec_fei/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/home/alec_fei/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/home/alec_fei/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/home/alec_fei/ycsb-0.17.0/lib/mysql-connector-j-8.0.32.jar:/home/alec_fei/ycsb-0.17.0/mongodb-binding/lib/logback-classic-1.1.2.jar:/home/alec_fei/ycsb-0.17.0/mongodb-binding/lib/logback-core-1.1.2.jar:/home/alec_fei/ycsb-0.17.0/mongodb-binding/lib/mongo-java-driver-3.8.0.jar:/home/alec_fei/ycsb-0.17.0/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/home/alec_fei/ycsb-0.17.0/mongodb-binding/lib/mongodb-binding-0.17.0.jar:/home/alec_fei/ycsb-0.17.0/mongodb-binding/lib/slf4j-api-1.7.25.jar:/home/alec_fei/ycsb-0.17.0/mongodb-binding/lib/snappy-java-1.1.7.1.jar site.ycsb.Client -load -db site.ycsb.db.MongoDbClient -s -P workloads/workloada
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
[OVERALL], RunTime(ms), 14880
[OVERALL], Throughput(ops/sec), 672.0430107526881
[TOTAL_GCS_PS_Scavenge], Count, 9
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 147
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.9879032258064515
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 9
[TOTAL_GC_TIME], Time(ms), 147
[TOTAL_GC_TIME_%], Time(%), 0.9879032258064515
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 4630.0
[CLEANUP], MinLatency(us), 4628
[CLEANUP], MaxLatency(us), 4631
[CLEANUP], 95thPercentileLatency(us), 4631
[CLEANUP], 99thPercentileLatency(us), 4631
[INSERT], Operations, 10000
[INSERT], AverageLatency(us), 1188.23
[INSERT], MinLatency(us), 158
[INSERT], MaxLatency(us), 562687
[INSERT], 95thPercentileLatency(us), 3553
[INSERT], 99thPercentileLatency(us), 19519
[INSERT], Return=OK, 10000