benchmark testing/load_workloada_mysql.txt
/usr/bin/java  -classpath /home/alec_fei/ycsb-0.17.0/conf:/home/alec_fei/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/home/alec_fei/ycsb-0.17.0/lib/core-0.17.0.jar:/home/alec_fei/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/home/alec_fei/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/home/alec_fei/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/home/alec_fei/ycsb-0.17.0/lib/mysql-connector-j-8.0.32.jar:/home/alec_fei/ycsb-0.17.0/jdbc-binding/conf:/home/alec_fei/ycsb-0.17.0/jdbc-binding/lib/commons-collections-3.2.1.jar:/home/alec_fei/ycsb-0.17.0/jdbc-binding/lib/commons-lang-2.4.jar:/home/alec_fei/ycsb-0.17.0/jdbc-binding/lib/commons-pool-1.5.4.jar:/home/alec_fei/ycsb-0.17.0/jdbc-binding/lib/geronimo-jms_1.1_spec-1.1.1.jar:/home/alec_fei/ycsb-0.17.0/jdbc-binding/lib/geronimo-jta_1.1_spec-1.1.1.jar:/home/alec_fei/ycsb-0.17.0/jdbc-binding/lib/jdbc-binding-0.17.0.jar:/home/alec_fei/ycsb-0.17.0/jdbc-binding/lib/openjpa-jdbc-2.1.1.jar:/home/alec_fei/ycsb-0.17.0/jdbc-binding/lib/openjpa-kernel-2.1.1.jar:/home/alec_fei/ycsb-0.17.0/jdbc-binding/lib/openjpa-lib-2.1.1.jar:/home/alec_fei/ycsb-0.17.0/jdbc-binding/lib/serp-1.13.1.jar site.ycsb.Client -load -db site.ycsb.db.JdbcDBClient -P ./jdbc-binding/conf/db.properties -P workloads/workloada
Adding shard node URL: jdbc:mysql://localhost:3306/BenchTestA
Using shards: 1, batchSize:-1, fetchSize: -1
[OVERALL], RunTime(ms), 273484
[OVERALL], Throughput(ops/sec), 36.56521039622062
[TOTAL_GCS_PS_Scavenge], Count, 29
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 152
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.05557911980225535
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 29
[TOTAL_GC_TIME], Time(ms), 152
[TOTAL_GC_TIME_%], Time(%), 0.05557911980225535
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 285056.0
[CLEANUP], MinLatency(us), 284928
[CLEANUP], MaxLatency(us), 285183
[CLEANUP], 95thPercentileLatency(us), 285183
[CLEANUP], 99thPercentileLatency(us), 285183
[INSERT], Operations, 10000
[INSERT], AverageLatency(us), 26976.0472
[INSERT], MinLatency(us), 8224
[INSERT], MaxLatency(us), 805887
[INSERT], 95thPercentileLatency(us), 59839
[INSERT], 99thPercentileLatency(us), 96895
[INSERT], Return=OK, 10000